title: PowerShell Network Obfuscation
id: 9f3f65e3-0b2f-42dc-9e34-bf2238f4505d
status: experimental
description: Detects use of PowerShell with hidden or encoded flags
author: you@example.com
logsource:
  product: windows
  service: security
detection:
  selection:
    CommandLine|contains:
      - 'powershell'
      - '-EncodedCommand'
      - '-nop'
      - '-w hidden'
  condition: selection
fields:
  - CommandLine
  - Image
  - User
  - EventID
falsepositives:
  - Administrative scripts
level: high
tags:
  - attack.execution
  - attack.t1059.001

